import streamlit as st 

st.header("تست انتخاب بهترین فرد خاندان")
st.write("گزینه ی مورد نظر خودتو انتخاب کن و دکمه ی ثبت رو بزن")
op = st.selectbox("انتخاب", ["احمدرضا", "روژان", "یاشار", "امیرارسلان", "علیرضا", "داداشی", "حمیدرضا"])
bt = st.button("ثبت")
if bt:
    if op == "احمدرضا":
        st.write("نزدیک بود اما نه یه نفر دیگه بهترینه")
        st.error("جوابت اشتباهه")
    elif op == "روژان":
        st.write("خودت خندت نگرفت یه دلستر رو انتخاب کردی؟")
        st.error("جوابت اشتباهه")
    elif op == "یاشار":
        st.write("مهندس برق جواب جالبی نبود ")
        st.error("جوابت اشتباهه")
    elif op == "امیرارسلان":
        st.write("ا لاش پنیری جواب درست نیست")
        st.error("جوابت اشتباهه")
    elif op == "علیرضا":
        st.write("سپهر حیدری اگه ایذه ای  بود")
        st.error("جوابت اشتباهه")
    elif op == "داداشی":
        st.write("خخخخخخخخخخخخخخخ")
        st.error("جوابت اشتباهه")
    elif op == "حمیدرضا":
        st.write("آفرین جواب درست حمید بزرگه")
        st.success("تبریک")